tap "dzirtusss/tap"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae", trusted: true
tap "laishulu/homebrew"
tap "nikitabobko/tap"
# Lean Theorem Prover installer and version manager
brew "elan-init"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GitHub command-line tool
brew "gh"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Rime Input Method Engine
brew "librime"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Development kit for the Java programming language
brew "openjdk@21", link: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# It's not just a linter that annoys you!
brew "pylint"
# Tool Command Language
brew "tcl-tk"
# Python interface to Tcl/Tk
brew "python-tk@3.14"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Markup-based typesetting system
brew "typst"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Tracks most-used directories to make cd smarter
brew "z"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Chromium based browser
cask "arc"
# App for managing battery charging
cask "batfi"
# Display management tool
cask "betterdisplay"
# Write, edit, and chat about your code with AI
cask "cursor"
cask "font-jetbrains-mono-nerd-font"
# Free and open-source media player
cask "iina"
# Java IDE by JetBrains
cask "intellij-idea"
# GPU-based terminal emulator
cask "kitty"
# Minecraft modding platform
cask "modrinth"
# Open-source music notation software
cask "musescore"
# VPN client focusing on security
cask "protonvpn"
# Instant messaging tool
cask "qq"
# 3D CAD software
cask "shapr3d"
# Rime input method engine
cask "squirrel-app"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# Multimedia player
cask "vlc"
# Gecko based web browser
cask "zen"
